tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "spl/pdftk"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Record and share terminal sessions
brew "asciinema"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Collection of portable C++ source libraries
brew "boost"
# Core application library for C
brew "glib"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Tool for browsing source code
brew "cscope"
# Reimplementation of ctags(1)
brew "ctags"
# More intuitive version of du in rust
brew "dust"
# Prepare CD image files so they compress better
brew "ecm"
# Read-only implementation of ext4 for FUSE
brew "ext4fuse"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Library to render SVG files using Cairo
brew "librsvg"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Next-gen compiler infrastructure
brew "llvm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Rewrite of netcat that supports IPv6, plus other improvements
brew "netcat6"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node", link: false
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Cross-platform application and UI framework
brew "qt"
# Cross-platform application and UI framework
brew "qt@5"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Version control system designed to be a better CVS
brew "subversion"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Password manager
cask "1password-nightly"
# Application launcher and productivity software
cask "alfred"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Web browser
cask "firefox"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Media key forwarder for iTunes and Spotify
cask "macmediakeyforwarder"
# File system integration
cask "osxfuse"
# IDE for application development
cask "qt-creator"
# Archive manager for data compression and backups
cask "rar"
# Music streaming service
cask "spotify"
# Window manager
cask "tiles"
# Multimedia player
cask "vlc"
